/* default remote msg description */
"A default remote needs to be set for this branch. You can set the default remote in the branch's context menu." = "A default remote needs to be set for this branch. You can set the default remote in the branch's context menu.";

/* already a git repository */
"Already A Git Repository" = "Already A Git Repository";

/* init error description */
"An unknown error occurred while initializing the repo" = "An unknown error occurred while initializing the repo";

/* remote delete msg */
"Are you absolutely sure?" = "Are you absolutely sure?";

/* delete remote msg
   delete submodule msg
   discard msg
   git discard
   git remove
   merge branch msg
   mv files to trash
   reset msg
   stash delete msg */
"Are you sure?" = "Are you sure?";

/* cancel button label */
"Cancel" = "Cancel";

/* cant find file merge msg */
"Cannot Find FileMerge" = "Cannot Find FileMerge";

/* not a git repo */
"Cannot Open Directory" = "Cannot Open Directory";

/* check for updates msg */
"Check For Updates?" = "Check For Updates?";

/* cherry pick msg */
"Cherry Pick This Commit?" = "Cherry Pick This Commit?";

/* choose button label */
"Choose" = "Choose";

/* default remote msg */
"Clone Timed Out" = "Clone Timed Out";

/* dirty working dir msg description */
"Commit, or reset to head before branching." = "Commit, or reset to head before branching.";

/* config key incorrect msg */
"Config Key Incorrect" = "Config Key Incorrect";

/* config key incorrect msg description */
"Config keys must contain a section and name. (section.varname)" = "Config keys must contain a section and name. (section.varname)";

/* default remote msg */
"Default Remote Not Set" = "Default Remote Not Set";

/* delete remote msg description */
"Do you really want delete this remote?" = "Do you really want delete this remote?";

/* delete submodule msg description */
"Do you really want delete this submodule?" = "Do you really want delete this submodule?";

/* stash delete msg description */
"Do you really want to delete this stash?" = "Do you really want to delete this stash?";

/* git discard msg description */
"Do you really want to discard local changes?" = "Do you really want to discard local changes?";

/* discard msg description */
"Do you really want to discard unstaged changes?" = "Do you really want to discard unstaged changes?";

/* merge branch msg description */
"Do you really want to merge this branch onto the current branch?" = "Do you really want to merge this branch onto the current branch?";

/* move files to trash msg description */
"Do you really want to move these files to the trash?" = "Do you really want to move these files to the trash?";

/* git remove msg description */
"Do you really want to remove these files from the git repository?" = "Do you really want to remove these files from the git repository?";

/* reset msg description */
"Do you really want to reset the repo back to HEAD? You will lose all staged and non-staged changes." = "Do you really want to reset the repo back to HEAD? You will lose all staged and non-staged changes.";

/* check for updates msg description */
"Do you want Gity to check for updates on startup?" = "Do you want Gity to check for updates on startup?";

/* remote repo not available msg description */
"Either you're not connected to the internet, or the server hung up unexpectedly." = "Either you're not connected to the internet, or the server hung up unexpectedly.";

/* init error */
"Error Initializing" = "Error Initializing";

/* cant find git */
"Gity Can't Find Your Git Executable" = "Gity Can't Find Your Git Executable";

/* snow leopard msg */
"Gity Requires Mac OS X 10.6" = "Gity Requires Mac OS X 10.6";

/* snow leopard msg description */
"Gity Uses New API's in Snow Leopard, sorry :(." = "Gity Uses New API's in Snow Leopard, sorry :(.";

/* no textmate binary msg description */
"I couldn't find the Textmate binary, please install it from Textmate." = "I couldn't find the Textmate binary, please install it from Textmate.";

/* remote delete msg description */
"I noticed this is the origin remote, are you really sure?" = "I noticed this is the origin remote, are you really sure?";

/* cant find git msg description */
"I searched in common places and couldn't find the git executable, please tell me where it is" = "I searched in common places and couldn't find the git executable, please tell me where it is";

/* report commit msg description */
"If this commit is rendered incorrectly, or if there is something else wrong with it, this will send it to Mac Endeavor to look at." = "If this commit is rendered incorrectly, or if there is something else wrong with it, this will send it to Mac Endeavor to look at.";

/* report diff msg description */
"If this diff is rendered incorrectly, or if there is something else wrong with it, this will send it to Mac Endeavor to look at." = "If this diff is rendered incorrectly, or if there is something else wrong with it, this will send it to Mac Endeavor to look at.";

/* initialize a repo open panel title */
"Initialize Directory As A Git Repository" = "Initialize Directory As A Git Repository";

/* invalid destination msg */
"Invalid Destination" = "Invalid Destination";

/* license expired msg */
"Invalid License" = "Invalid License";

/* already a git repo msg description */
"It appears this directory is already a git repository" = "It appears this directory is already a git repository";

/* not a git repo msg description */
"It appears this directory is not a git repository" = "It appears this directory is not a git repository";

/* not a git repo directory */
"It doesn't appear to be a git repository." = "It doesn't appear to be a git repository.";

/* merge error msg */
"Merge Error" = "Merge Error";

/* no button label */
"No" = "No";

/* no textmate binary msg */
"No Textmate Binary Found" = "No Textmate Binary Found";

/* ok button label
   yes button label */
"OK" = "OK";

/* permission denied msg */
"Permission Denied" = "Permission Denied";

/* permission denied msg description */
"Permission was denied, make sure ssh is setup correctly." = "Permission was denied, make sure ssh is setup correctly.";

/* push error msg */
"Push Error" = "Push Error";

/* dup remote msg */
"Remote Already Exists" = "Remote Already Exists";

/* remote host not verified msg */
"Remote Host Not Verified" = "Remote Host Not Verified";

/* remote repo not available msg */
"Remote Repo Not Available" = "Remote Repo Not Available";

/* report commit msg */
"Report Commit To Mac Endeavor?" = "Report Commit To Mac Endeavor?";

/* report diff msg */
"Report Diff To Mac Endeavor?" = "Report Diff To Mac Endeavor?";

/* resolve conflicts msg */
"Resolve Conflicts First" = "Resolve Conflicts First";

/* working dir conflicts msg description */
"Resolve your conflicts before going any further" = "Resolve your conflicts before going any further";

/* send button label */
"Send" = "Send";

/* server not available msg */
"Server Not Available" = "Server Not Available";

/* session expired msg */
"Session Expired" = "Session Expired";

/* stage changes */
"Stage Your Changes Before Continuing" = "Stage Your Changes Before Continuing";

/* stash diff branch msg */
"Stash From Different Branch" = "Stash From Different Branch";

/* submodule dest incorrect msg */
"Submodule Destination Incorrect" = "Submodule Destination Incorrect";

/* submodule dest incorrect msg description */
"Submodules need to be anywhere inside of this git project's directory." = "Submodules need to be anywhere inside of this git project's directory.";

/* textmate success msg */
"Success!" = "Success!";

/* merge error msg description */
"The branch I tried to merge doesn't point to a commit, nothing was merged." = "The branch I tried to merge doesn't point to a commit, nothing was merged.";

/* cant find file merge description */
"The command required (opendiff) to launch FileMerge was not found. Install Apple Developer Tools" = "The command required (opendiff) to launch FileMerge was not found. Install Apple Developer Tools";

/* resolve conflicts msg description */
"The current branch cannot be in a conflicted state." = "The current branch cannot be in a conflicted state.";

/* invalid destination msg description */
"The destination does not exist." = "The destination does not exist.";

/* invalid destination msg description */
"The destination is not a directory." = "The destination is not a directory.";

/* remote host not verified msg description */
"The remote host's public key must be verified and present in ~/.ssh/knownhosts." = "The remote host's public key must be verified and present in ~/.ssh/knownhosts.";

/* default remote msg description */
"The repository took more than 60 minutes to clone, something either went wrong or it's huge. Please clone it from the commandline." = "The repository took more than 60 minutes to clone, something either went wrong or it's huge. Please clone it from the commandline.";

/* server not available msg description */
"The server couldn't be connected to." = "The server couldn't be connected to.";

/* push error msg description */
"This remote can't be pushed to." = "This remote can't be pushed to.";

/* push newer error msg description */
"This remote can't be pushed to.  Please merge the remote changes before pushing again. " = "This remote can't be pushed to.  Please merge the remote changes before pushing again. ";

/* session expired msg description */
"This session has expired; purchase Gity to stop session expirations. You can restart Gity to continue using it." = "This session has expired; purchase Gity to stop session expirations. You can restart Gity to continue using it.";

/* stash diff branch msg description */
"This stash was originally saved from a different branch, do you still want to continue?" = "This stash was originally saved from a different branch, do you still want to continue?";

/* yes button label */
"Yes" = "Yes";

/* dup remote msg description */
"You already have a remote by that name." = "You already have a remote by that name.";

/* dirty working dir msg description */
"You can't checkout a branch until your working directory is clean" = "You can't checkout a branch until your working directory is clean";

/* dirty working dir msg description */
"You can't pull with rebase until your working directory is clean." = "You can't pull with rebase until your working directory is clean.";

/* stage changes msg directory */
"You must stage (add) all of you local changes before continuing" = "You must stage (add) all of you local changes before continuing";

/* dirty working dir msg description */
"You need a clean working directory before creating an empty branch." = "You need a clean working directory before creating an empty branch.";

/* dirty working for cherry msg description */
"You need a clean working directory before you can cherry pick a commit." = "You need a clean working directory before you can cherry pick a commit.";

/* textmate success msg description */
"You'll need to restart Textmate." = "You'll need to restart Textmate.";

/* license expired msg description */
"Your license for Gity is no longer valid." = "Your license for Gity is no longer valid.";

/* dirty working dir */
"Your Working Directory is Dirty" = "Your Working Directory is Dirty";

/* dirty working dir
   dirty working for cherry */
"Your working directory is dirty" = "Your working directory is dirty";

/* working dir conflicts */
"Your working directory is now in conflict" = "Your working directory is now in conflict";

